package com.kh.day7;
/*
    단어 맞추기 게임
    단어는 'program'로 설정되어있다.
    사용자는 남은 시도 횟수 안에 정답 단어를 맟주면 게임에서 이기게되고 그렇지않으면 진다.
    단어를 맞출수 있는 회수는 단어의 문자수 + 3
    ex) program

    현재 단어 : _______
    남은 시도 회수 : 10
    글자를 입력하세요 : p
    현재 단어 : p______
    남은 시도 회수 : 9
    글자를 입력하세요 : z
    현재 단어 : p______
    남은 시도 회수 : 8
    글자를 입력하세요 : r
    현재 단어 : pr__r__
    남은 시도 회수 : 7
    글자를 입력하세요 :
    ....
    현재 단어 : progra_
    남은 시도 회수 : 1
    글자를 입력하세요 : m
    축하합니다! 단어를 맞췄습니다. : program
 */
public class Question1 {

}
