package com.kh.day5;

import java.util.Scanner;

/*
    ATM기 입출금 구현하기
    제약조건 : 1. 마이너스 통장이 아니다.
              2. 구좌에 최대 10만원까지 입금 가능하다.
              3. 1000원 미만으로 입출금 불가
              4. 메인 메소드 만을 사용하여 구현
    -----------------------------------
    메뉴 : 1. 입금  2.출금  3.잔액  0.종료
    ------------------------------------
    선택 : 1
    입금액 : 10000
    10000원이 입금되었습니다. 잔액 : 10000
    -----------------------------------
    메뉴 : 1. 입금  2.출금  3.잔액  0.종료
    ------------------------------------
    선택 : 3
    잔액 : 10000
    -----------------------------------
    메뉴 : 1. 입금  2.출금  3.잔액  0.종료
    ------------------------------------
    선택 : 2
    출금액 : 5000
    5000원이 출금되었습니다. 잔액 : 5000
    -----------------------------------
    메뉴 : 1. 입금  2.출금  3.잔액  0.종료
    ------------------------------------
    선택 : 2
    출금액 : 10000
    잔액이 부족합니다   잔액 : 5000
    -----------------------------------
    메뉴 : 1. 입금  2.출금  3.잔액  0.종료
    -----------------------------------
    메뉴 : 0
    프로그램 종료!!
 */
public class Question1 {
    public static void main(String[] args) {

    }
}
